{
    "Title": "Mind-reading versus neuromarketing: how does a product make an impact on the consumer?",
    "Abstract": "Purpose: This research study aims to illustrate the mapping of each consumer’s mental processes in a market-relevant context. This paper shows how such maps deliver operational insights that cannot be gained by physical methods such as brain imaging. / Design/methodology/approach: A marketed conceptual attribute and a sensed material characteristic of a popular product were varied across presentations in a common use. The relative acceptability of each proposition was rated together with analytical descriptors. The mental interaction that determined each consumer’s preferences was calculated from the individual’s performance at discriminating each viewed sample from a personal norm. These personal cognitive characteristics were aggregated into maps of demand in the market for subpanels who bought these for the senses or for the attribute. / Findings: Each of 18 hypothesized mental processes dominated acceptance in at least a few individuals among both sensory and conceptual purchasers. Consumers using their own descriptive vocabulary processed the factors in appeal of the product more centrally. The sensory and conceptual factors tested were most often processed separately, but a minority of consumers treated them as identical. The personal ideal points used in the integration of information showed that consumers wished for extremes of the marketed concept that are technologically challenging or even impossible. None of this evidence could be obtained from brain imaging, casting in question its usefulness in marketing. / Research limitations/implications: Panel mapping of multiple discriminations from a personal norm fills three major gaps in consumer marketing research. First, preference scores are related to major influences on choices and their cognitive interactions in the mind. Second, the calculations are completed on the individual’s data and the cognitive parameters of each consumer’s behavior are aggregated – never the raw scores. Third, discrimination scaling puts marketed symbolic attributes and sensed material characteristics on the same footing, hence measuring their causal interactions for the first time. / Practical implications: Neuromarketing is an unworkable proposition because brain imaging does not distinguish qualitative differences in behavior. Preference tests are operationally effective when designed and analyzed to relate behavioral scores to major influences from market concepts and sensory qualities in interaction. The particular interactions measured in the reported study relate to the major market for healthy eating. / Originality/value: This is the first study to measure mental interactions among determinants of preference, as well as including both a marketed concept and a sensed characteristic. Such an approach could be of great value to consumer marketing, both defensively and creatively.",
    "Type:": "Article",
    "Title:": "Mind-reading versus neuromarketing: how does a product make an impact on the consumer?",
    "Open access status:": "An open access version is available from UCL Discovery",
    "DOI:": "10.1108/JCM-08-2013-0674",
    "Publisher version:": "http://dx.doi.org/10.1108/JCM-08-2013-0674",
    "Language:": "English",
    "Additional information:": "Copyright © Emerald Group Publishing Limited 2014.",
    "Keywords:": "Conceptual–sensory interaction, Individual acceptance, Neuromarketing, Peripheral and central processing, Personal norms",
    "UCL classification:": "UCLUCL > Provost and Vice Provost OfficesUCL > Provost and Vice Provost Offices > School of EducationUCL > Provost and Vice Provost Offices > School of Education > UCL Institute of EducationUCL > Provost and Vice Provost Offices > School of Education > UCL Institute of Education > IOE - Centre for Doctoral Education",
    "URI:": "https://discovery.ucl.ac.uk/id/eprint/1475882"
}